DAZI0424/ESP-DET/firmware/welland_ingredient_detector/sdkconfig.defaults
# ESP32-S3-N16R8 / HW-679 performance configuration.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_WIFI_TASK_PINNED_TO_CORE_0=y
CONFIG_LWIP_TCPIP_TASK_AFFINITY_CPU0=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x9000

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0
# CONFIG_CAMERA_PSRAM_DMA is not set

CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

CONFIG_WELLAND_CAM_HMIRROR=y
CONFIG_WELLAND_CAM_XCLK_MHZ=20
# CONFIG_WELLAND_CAM_VFLIP is not set
CONFIG_WELLAND_CAM_AWB_GRAY_WORLD=y
CONFIG_WELLAND_CAM_AEC_TARGET=68
CONFIG_WELLAND_CAM_WARMUP_FRAMES=12
CONFIG_WELLAND_DETECTION_SCORE_PERCENT=70
CONFIG_WELLAND_DETECTION_NMS_PERCENT=70
CONFIG_WELLAND_RECOGNITION_SINGLE_HIGH_PERCENT=92
CONFIG_WELLAND_RECOGNITION_SINGLE_MARGIN_PERCENT=18
CONFIG_WELLAND_RECOGNITION_MULTI_EVIDENCE_PERCENT=85
CONFIG_WELLAND_RECOGNITION_MULTI_MARGIN_PERCENT=15
CONFIG_WELLAND_RECOGNITION_CLASS_APPLE_PERCENT=80
CONFIG_WELLAND_RECOGNITION_CLASS_BANANA_PERCENT=80
CONFIG_WELLAND_RECOGNITION_CLASS_STRAWBERRY_PERCENT=80
CONFIG_WELLAND_RECOGNITION_CLASS_LETTUCE_PERCENT=80
CONFIG_WELLAND_RECOGNITION_CLASS_EGG_PERCENT=80
CONFIG_WELLAND_RECOGNITION_CLASS_ORANGE_PERCENT=80
CONFIG_WELLAND_RECOGNITION_CLASS_EGGPLANT_PERCENT=80
CONFIG_WELLAND_RECOGNITION_CLASS_CUCUMBER_PERCENT=80
CONFIG_WELLAND_RECOGNITION_CLASS_CARROT_PERCENT=80
CONFIG_WELLAND_RECOGNITION_CLASS_CORN_PERCENT=80
CONFIG_WELLAND_RECOGNITION_MAX_VALID_INFERENCES=3
CONFIG_WELLAND_RECOGNITION_TARGET_MISSING_VALID_FRAMES=1
CONFIG_WELLAND_QUALITY_MOTION_MAX_PERMILLE=70
CONFIG_WELLAND_QUALITY_MOTION_EXIT_PERMILLE=120
CONFIG_WELLAND_QUALITY_STABLE_FRAMES_REQUIRED=2
CONFIG_WELLAND_QUALITY_PRESENTATION_ROI_PERCENT=70
CONFIG_WELLAND_QUALITY_TARGET_ROI_EXPAND_PERCENT=20
CONFIG_WELLAND_QUALITY_SCENE_CHANGE_PIXEL_DELTA=32
CONFIG_WELLAND_QUALITY_SCENE_CHANGE_CHANGED_PERMILLE=600
CONFIG_WELLAND_QUALITY_SCENE_CHANGE_REQUIRED_FRAMES=2
CONFIG_WELLAND_QUALITY_SHARPNESS_MIN=15
CONFIG_WELLAND_QUALITY_SHARPNESS_GOOD=80
CONFIG_WELLAND_QUALITY_EXPOSURE_MEAN_MIN=25
CONFIG_WELLAND_QUALITY_EXPOSURE_MEAN_MAX=235
CONFIG_WELLAND_QUALITY_DARK_LUMA_MAX=8
CONFIG_WELLAND_QUALITY_BRIGHT_LUMA_MIN=247
CONFIG_WELLAND_QUALITY_CLIPPED_MAX_PERMILLE=300
CONFIG_WELLAND_QUALITY_WEIGHT_FLOOR_PERMILLE=500
CONFIG_WELLAND_RECOGNITION_BOX_MIN_AREA_PERMILLE=20
CONFIG_WELLAND_RECOGNITION_BOX_MAX_AREA_PERMILLE=930
CONFIG_WELLAND_RECOGNITION_BOX_MIN_SIDE_PIXELS=16
CONFIG_WELLAND_RECOGNITION_BOX_MAX_ASPECT_PERMILLE=4000
CONFIG_WELLAND_RECOGNITION_CONSISTENCY_IOU_PERMILLE=150
CONFIG_WELLAND_RECOGNITION_CONSISTENCY_CENTER_SHIFT_PERMILLE=220
CONFIG_WELLAND_RECOGNITION_CONSISTENCY_AREA_MIN_PERMILLE=500
CONFIG_WELLAND_RECOGNITION_CONSISTENCY_AREA_MAX_PERMILLE=2000
CONFIG_WELLAND_RECOGNITION_OBVIOUS_SWITCH_PERCENT=90
CONFIG_WELLAND_RECOGNITION_OBVIOUS_SWITCH_MARGIN_PERCENT=25
CONFIG_WELLAND_RECOGNITION_SESSION_TIMEOUT_MS=15000
